Tekla Open API Reference for Tekla Structures 2025
ReferenceModel Constructor
 Initializes a new instance of the ReferenceModel class.
 The default values are as follows:
 Filename = string.Empty;
 ActiveFilePath = string.Empty;
 ProjectGUID = Guid.Empty;
 ModelGUID = Guid.Empty;
 VersionGUID = Guid.Empty;
 Position = new Point();
 Scale = 1.0;
 Visibility = VisibilityEnum.VISIBLE;
 BasePointGuid = string.Empty;
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReferenceModel()
Public Sub New
See Also
Reference
ReferenceModel Class
ReferenceModel Overload
Tekla.Structures.Model Namespace